# Используем официальный базовый образ Python
FROM python:3.10-slim-buster

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
# --no-cache-dir для уменьшения размера образа
# -r requirements.txt для установки из файла
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальной код приложения в рабочую директорию
COPY . .

# Открываем порт 8000, который использует Uvicorn
EXPOSE 8000

# Команда для запуска приложения при старте контейнера
# Uvicorn будет слушать на 0.0.0.0, чтобы быть доступным извне контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]